Repository: supermuka/auge_server
Catalog: lib/shared/message/i18n/intl_domain_messages_*.arb
Languages: pt_br

# CommonFieldAndValuesMsg_labelAndValue
source: {fieldName,select, true{Yes}false{No}other{Not Defined}}
pt_br: {fieldName,select, true{Sim}false{Não}other{Não Definido}}

# ClassNameMsg_label
source: {className,select, User{the User}UserProfile{the User Profile}UserAccess{the User and Profiles}Group{the Group}Objective{the Objective}Measure{the Measure}MeasureProgress{the Measure Progress}Work{the Work}WorkStage{the Stage}WorkItem{the Work Item}other{Not Defined}}
pt_br: {className,select, User{Usuário}UserProfile{Perfil do Usuário}UserAccess{Usuário e Acesso}Group{Grupo}Objective{Objetivo}Measure{Medida}MeasureProgress{Progresso da Medida}Work{Trabalho}WorkStage{Estágio}WorkItem{Item de Trabalho}other{Não Definido}}

# UserDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}inactiveField{Inactive}managedByOrganizationField{Managed By Organization}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}inactiveField{Inativo}managedByOrganizationField{Gerenciado pela Organização}other{Não Definido}}

# UserProfileDomainMsg_fieldLabel
source: {fieldName,select, eMailField{e-Mail}eMailNotificationField{e-Mail Notification}imageField{Image}idiomLocaleField{Idioma}other{Not Defined}}
pt_br: {fieldName,select, eMailField{e-Mail}eMailNotificationField{Notificação de e-Mail}imageField{Imagem}idiomLocaleField{Idioma}other{Não Definido}}

# UserIdentityDomainMsg_fieldLabel
source: {fieldName,select, identificationField{Identification}passwordField{Password}providerField{Provider}providerObjectIdField{Provider Object Id}other{Not Defined}}
pt_br: {fieldName,select, identificationField{Identificação}passwordField{Senha}providerField{Provedor}providerObjectIdField{Id do Objeto Provedor}other{Não Definido}}

# UserAccessDomainMsg_fieldLabel
source: {fieldName,select, organizationField{Organization}accessRoleField{Access Role}other{Not Defined}}
pt_br: {fieldName,select, organizationField{Organização}accessRoleField{Papel de Acesso}other{Não Definido}}

# GroupDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}inactiveField{Inactive}leaderField{Leader}groupTypeField{Group Type}superGroupField{Super Group}membersField{Members}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}inactiveField{Inativo}leaderField{Líder}groupTypeField{Tipo do Grupo}superGroupField{Super Grupo}membersField{Membros}other{Não Definido}}

# ObjectiveDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}descriptionField{Description}groupField{Group}alignedToField{Aligned To}leaderField{Leader}startDateField{Start Date}endDateField{End Date}archivedField{Archived}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}descriptionField{Descrição}groupField{Grupo}alignedToField{Alinhado para}leaderField{Líder}startDateField{Data de Início}endDateField{Data de Término}archivedField{Arquivado}other{Não Definido}}

# MeasureUnitDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}symbolField{Symbol}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}symbolField{Símbolo}other{Não Definido}}

# MeasureDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}descriptionField{Description}endValueField{End Value}startValueField{Start Value}currentValueField{Current Value}decimalsNumberField{Decimals Number}measureUnitField{Unit}metricField{Metric}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}descriptionField{Descrição}endValueField{Valor Final}startValueField{Valor Inicial}currentValueField{Valor Corrente}decimalsNumberField{Número de Decimais}measureUnitField{Unidade}metricField{Métrica}other{Não Definido}}

# MeasureProgressDomainMsg_fieldLabel
source: {fieldName,select, dateField{Date}currentValueField{Current Value}commentField{Comment}other{Not Defined}}
pt_br: {fieldName,select, dateField{Data}currentValueField{Valor Corrente}commentField{Comentário}other{Não Definido}}

# OrganizationDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}codeField{EIN}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}codeField{CNPJ}other{Não Definido}}

# WorkDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}descriptionField{Description}groupField{Group}leaderField{Leader}workStagesField{Stages}objectiveField{Objective}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}descriptionField{Descrição}groupField{Grupo}leaderField{Líder}workStagesField{Estágios}objectiveField{Objetivo}other{Não Definido}}

# WorkStageDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}stateField{State}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}stateField{Estado}other{Não Definido}}

# WorkItemDomainMsg_fieldLabel
source: {fieldName,select, nameField{Name}descriptionField{Description}dueDateField{Due Date}completedField{Completed}workStageField{Stage}assignedToField{Assigned To}attachmentsField{Attachments}checkItemsField{Check Items}other{Not Defined}}
pt_br: {fieldName,select, nameField{Nome}descriptionField{Descrição}dueDateField{Data Limite}completedField{Concluído}workStageField{Estágio}assignedToField{Atribuído para}attachmentsField{Anexos}checkItemsField{Itens de Checagem}other{Não Definido}}

# OrganizationConfigurationDomainMsg_fieldLabel
source: {fieldName,select, domainField{Domínio}other{Not Defined}}
pt_br: {fieldName,select, domainField{Domínio}other{Não Definido}}

# OrganizationDirectoryServiceDomainMsg_fieldLabel
source: {fieldName,select, directoryServiceEnabledField{Directory Service (LDAP) Enabled}hostAddressField{Host Address}portField{Port}sslTlsField{SSL/TLS Enabled}syncBindDnField{Sync Bind DN}syncBindPasswordField{Sync Bind Password (not saved)}groupSearchDNField{Group Search DN}groupSearchScopeField{Group Search Scope}groupSearchFilterField{Group Search Filter}groupMemberUserAttributeField{Group Member User Attribute}userSearchDNField{User Search DN}userSearchScopeField{User Search Scope}userSearchFilterField{User Search Filter}userProviderObjectIdAttributeField{User Provider Object Id (GUID/UUID) Attribute}userIdentificationAttributeField{User Identification (login) Attribute}userFirstNameAttributeField{User First Attribute}userLastNameAttributeField{User Last Attribute}userEmailAttributeField{User Email Attribute}userAttributeForGroupRelationshipField{User Attribute for Group Relationship}syncIntervalField{Sync Interval (hours)}syncLastDateTimeField{Sync Last Date Time}syncLastResultField{Sync Last Result}other{Not Defined}}
pt_br: {fieldName,select, directoryServiceEnabledField{Serviço de Diretório (LDAP) Habilitado}hostAddressField{Endereço Servidor (host)}portField{Porta}sslTlsField{SSL/TLS Habilitado}syncBindDnField{DN Bind - Sincronizar}syncBindPasswordField{Senha Bind (não salva) - Sincronizar}groupSearchDNField{DN de Busca do Grupo}groupSearchScopeField{Escopo de Busca do Grupo}groupSearchFilterField{Filtro de Busca do Grupo}groupMemberUserAttributeField{Attributo de Usuário Membro do Grupo}userSearchDNField{DN de Busca de Usuário}userSearchScopeField{Escopo de Busca de Usuário}userSearchFilterField{Filtro de Busca do Usuário}userProviderObjectIdAttributeField{Attributo (GUID/UUID) do ID de Objeto do Provedor para Usuário}userIdentificationAttributeField{Atributo Identificação (login) do Usuário}userFirstNameAttributeField{Attributo Primeiro Nome do Usuário}userLastNameAttributeField{Atributo Último Nome do Usuário}userEmailAttributeField{Atributo de e-Mail do Usuário}userAttributeForGroupRelationshipField{Atributo do Usuário para Relacionamento com o Grupo}syncIntervalField{Intervalo de Sincronização (horas)}syncLastDateTimeField{Última Data e Hora da Sincronização}syncLastResultField{Último Resultado da Sincronização}other{Não Definido}}

# UserProfileValueMsg_label
source: {valueName,select, pt_BR{Português - Brasil}en_US{English - USA}es_ES{Espanhol - España}other{Not Defined}}
pt_br: {valueName,select, pt_BR{Português - Brasil}en_US{English - USA}es_ES{Espanhol - España}other{Não Definido}other{Não Definido}}
