Repository: supermuka/auge_server
Catalog: lib/shared/message/i18n/intl_messages_*.arb
Languages: pt_br

# CommonMsg_label
source: {label,select, headerTitleLabel{AUGE}headerSubtitleLabel{Objectives, Work and Performance}searchLabel{Search}filterLabel{Filter}moreLabel{more}emptyLabel{empty}other{Not Defined}}
pt_br: {label,select, headerTitleLabel{AUGE}headerSubtitleLabel{Objetivos, Trabalho e Desempenho}searchLabel{Busca}filterLabel{Filtro}moreLabel{mais}emptyLabel{vazio}ofLabel{de}other{Não Definido}}

# CommonMsg_buttonLabel
source: {label,select, applyButtonLabel{Apply}editButtonLabel{Edit}deleteButtonLabel{Delete}saveButtonLabel{Save}cancelButtonLabel{Cancel}closeButtonLabel{Close}uploadButtonLabel{Upload}clearButtonLabel{Clear}loginButtonLabel{Login}logoutButtonLabel{Logout}selectPhotoButtonLabel{Select Photo}other{Not Defined}}
pt_br: {label,select, applyButtonLabel{Aplicar}editButtonLabel{Editar}deleteButtonLabel{Deletar}saveButtonLabel{Salvar}cancelButtonLabel{Cancelar}closeButtonLabel{Fechar}uploadButtonLabel{Carregar}clearButtonLabel{Limpar}loginButtonLabel{Logar}logoutButtonLabel{Sair}selectPhotoButtonLabel{Selecioanr Foto}other{Não Definido}}

# CommonMsg_requiredValueMsg
source: Enter with a required value
pt_br: Entre com o valor requerido.

# AuthMsg_label
source: {label,select, domainLabel{name@domain.com}identificationLabel{Identification}passwordLabel{Password}selectLabel{Select}superAdminLabel{Super Admin}organizationLabel{Organization}allOrganizationsLabel{All Organizations}loginLabel{Login}logoutLabel{Logout}requestCodeToNewPasswordLabel{Request Code to New Password}informCodeLabel{Inform the Code}defineNewPasswordLabel{Define New Password}passwordCodeLabel{Code}newPasswordLabel{New Password}repeatNewPasswordLabel{Repeat New Password}saveLabel{Save}other{Not Defined}}
pt_br: {label,select, domainLabel{nome@dominio.com}identificationLabel{Identificação}passwordLabel{Senha}selectLabel{Selecionar}superAdminLabel{Super Admin}organizationLabel{Organização}allOrganizationsLabel{Todas Organizações}loginLabel{Logar}logoutLabel{Sair}requestCodeToNewPasswordLabel{Soliciar Código para Nova Senha}informCodeLabel{Inserir Código}defineNewPasswordLabel{Defina Nova Senha}passwordCodeLabel{Código}newPasswordLabel{Nova Senha}repeatNewPasswordLabel{Repedir Nova Senha}saveLabel{Salvar}other{Não Definido}}

# AuthMsg_informIdentificationPasswordCorrectlyMsg
source: Inform an identification and password correctly.
pt_br: Informe uma identificação e senha corretamente.

# AuthMsg_userNotFoundMsg
source: User account not found with the identification and password informed.
pt_br: Conta de usuário não encontrada para identificação e senha informada.

# AuthMsg_organizationNotFoundMsg
source: An organization to user account not found.
pt_br: Uma organização para conta de usuário não foi encontrada.

# AuthMsg_serverApiErrorMsg
source: Server not available.
pt_br: Servidor não disponível.

# AuthMsg_browserCompatibleErrorMsg
source: Browser Compatible: Chrome
pt_br: Browser Compatível: Chrome

# AuthMsg_informIdentificationCorrectlyMsg
source: Inform an identification correctly.
pt_br: Informe uma identificação corretamente.

# AuthMsg_codeNotGeneratedMsg
source: Code not generated.
pt_br: Código não gerado.

# AuthMsg_informBelowTheCodeSentToEMailMsg
source: Inform below the code sent to e-mail
pt_br: Informe abaixo o código enviado para o e-mail.

# AuthMsg_codeValidateMsg
source: Code validate.
pt_br: Código validado.

# AuthMsg_newPasswordSavedMsg
source: New Password Saved.
pt_br: Nova senha salva.

# AuthMsg_passwordNotSavedMsg
source: Password not saved.
pt_br: Senha não salva.

# AppLayoutMsg_label
source: {label,select, organizationLabel{Organization}organizationsLabel{Organizations}adminLabel{Administrator}superAdminLabel{Super Administrator}userDetailLabel{User Detail}logoutLabel{Logout}ingightsLabel{Insights}worksLabel{Works}objectivesLabel{Objectives}objectivesMapLabel{Objectives Map}objectivesGanttLabel{Objectives Gantt}usersLabel{Users}groupsLabel{Groups}configurationLabel{Configuration}other{Not Defined}}
pt_br: {label,select, organizationLabel{Organização}organizationsLabel{Organizações}adminLabel{Administrador}superAdminLabel{Super Administrador}userDetailLabel{Detalhes do Usuário}logoutLabel{Sair}ingightsLabel{Insights}worksLabel{Trabalhos}objectivesLabel{Objetivos}objectivesMapLabel{Mapa de Objetivos}objectivesGanttLabel{Gantt de Objetivos}usersLabel{Usuários}groupsLabel{Grupos}configurationLabel{Configuração}other{Não Definido}}

# OrganizationMsg_label
source: {label,select, organizationsLabel{Organizations}editOrganizationLabel{Edit Organization}addOrganizationLabel{Add Organization}organizationDetailLabel{Organization Detail}other{Not Defined}}
pt_br: {label,select, organizationsLabel{Organizações}editOrganizationLabel{Editar Organização}addOrganizationLabel{Adicionar Organização}organizationDetailLabel{Detalhe da Organização}other{Não Definido}}

# ConfigurationMsg_label
source: {label,select, configurationLabel{Configuration}serverAndAdminLabel{Server and Admin}groupLabel{Group}synchronizationLabel{Synchronization}generalLabel{General}directoryServiceLabel{Directory Service}testConnectionLabel{Test Connection}syncAndSaveLabel{Sync and Save}other{Not Defined}}
pt_br: {label,select, configurationLabel{Configuração}serverAndAdminLabel{Servidor e Admin}groupLabel{Grupo}synchronizationLabel{Sincronização}generalLabel{Geral}directoryServiceLabel{Serviço de Diretório}testConnectionLabel{Testar Conexão}syncAndSaveLabel{Sincronizar e Salvar}other{Não Definido}}

# ConfigurationMsg_statusLabel
source: {label,select, finished{Finished.}errorException{An exception occured.}errorEmailAttributeNotFound{Email attribute not found.}errorFirstNameAttributeNotFound{First name attribute not found.}errorGroupOrGroupMemberNotFound{Group or group member not found.}errorGroupFilterInvalid{Group filter invalid.}errorLastNameAttributeNotFound{Last name attribute not found.}errorIdentificationAttributeNotFound{Identification (login) attribute not found.}errorUserAttributeForGroupRelationshipNotFound{User attribute for group relationship not found.}errorNotBoundInvalidCredentials{Not binded. Invalid credentials.}errorNotConnected{Not connected.}errorUserNotFound{User not found.}other{Not Defined}}
pt_br: {label,select, finished{Concluído.}errorException{Uma exceção ocorreu.}errorEmailAttributeNotFound{Atributo de email não encontrado.}errorFirstNameAttributeNotFound{Atributo de primeiro nome não encontrado.}errorGroupOrGroupMemberNotFound{Grupo ou membro do grupo não econtrado.}errorGroupFilterInvalid{Filtro do grupo inválido.}errorLastNameAttributeNotFound{Atributo do último nome não encontrado.}errorIdentificationAttributeNotFound{Atributo de identificação (logar) não encontrado.}errorUserAttributeForGroupRelationshipNotFound{Atributo de usuário para relacionamento com o grupo não encontrado.}errorNotBoundInvalidCredentials{Não associado. Credencial inválida.}errorNotConnected{Não conectado.}errorUserNotFound{Usuário não encontrado.}other{Não Definido}}

# ConfigurationMsg_searchScopeLabel
source: {label,select, baseLevel{Base Level}oneLevel{One Level}subLevel{Sub Level}subordinateSubtree{Subordinate Subtree}other{Not Defined}}
pt_br: {label,select, baseLevel{Nível base}oneLevel{Nível Um}subLevel{Sub Nível}subordinateSubtree{Subarvore Subordinada}other{Não Definido}}

# ConfigurationMsg_eventSyncResultLabel
source: {label,select, entry{Entry}skipEntry{Skip Entry}userInsert{User Insert}userUpdate{User Update}userDelete{User Delete}userIdentityInsert{User Identity Insert}userIdentityUpdate{User Identity Update}userIdentityDelete{User Identity Delete}userAccessInsert{User Access Insert}userAccessUpdate{User Access Update}userAccessDelete{User Access Delete}other{Not Defined}}
pt_br: {label,select, entry{Entre}skipEntry{Pular Entrada}userInsert{Inserir Usuário}userUpdate{Atualizar Usuário}userDelete{Deletar Usuário}userIdentityInsert{Inserir Identidade do Usuário}userIdentityUpdate{Atualizar Identidade do Usuário}userIdentityDelete{Deletar Identidade do Usuário}userAccessInsert{Inserir Acesso do Usuário}userAccessUpdate{Atualizar Acesso do Usuário}userAccessDelete{Deletar Acesso do Usuário}other{Não Definido}}

# UserMsg_label
source: {label,select, usersLabel{Users}userLabel{User}editUserLabel{Edit User}addUserLabel{Add User}profileLabel{Profile}identityLabel{Identity}accessLabel{Access}other{Not Defined}}
pt_br: {label,select, usersLabel{Usuários}userLabel{Usuário}editUserLabel{Editar Usuário}addUserLabel{Adicionar Usuário}profileLabel{Perfil}identityLabel{Identidade}accessLabel{Acesso}other{Não Definido}}

# UserMsg_domainOrganizationConfigurationRequiredMsg
source: Domain on organization configuration is required.
pt_br: Domínio na configuração da organização é requerida.

# UserMsg_identificationRequiredMsg
source: Identification is required.
pt_br: Identificação é requerida.

# UserMsg_invalidIdentificationMsg
source: Identification format invalid. Valid format example: id@domain.com
pt_br: Formato da identificação é inválido. Exemplo de formato válido: id@dominio.com

# UserIdentityMsg_label
source: {label,select, internal{Internal}directoryService{Directory Service}other{Not Defined}}
pt_br: {label,select, internal{Interno}directoryService{Serviço de Diretório}other{Não Definido}}

# UserAccessMsg_label
source: {label,select, superAdmin{Super Admin}admin{Admin}standard{Standard}other{Not Defined}}
pt_br: {label,select, superAdmin{Super Admin}admin{Admin}standard{Padrão}other{Não Definido}}

# WorkMsg_label
source: {label,select, worksLabel{Works}sortedByLabel{Sorted By}editWorkLabel{Edit Work}addWorkLabel{Add Work}objectiveLabel{Objective}workItemsOverDueLabel{Work Items Over Due}noMatchLabel{No Match}selectLabel{Select}filterWorksLabel{Filter Works}other{Not Defined}}
pt_br: {label,select, worksLabel{Trabalhos}sortedByLabel{Ordenar Por}editWorkLabel{Editar Trabalho}addWorkLabel{Adicionar Trabalho}objectiveLabel{Objetivo}workItemsOverDueLabel{Itens de Trabalho Atrasados}noMatchLabel{Sem Correspondência}selectLabel{Selecionar}filterWorksLabel{Filtar Trabalhos}other{Não Definido}}

# StageMsg_label
source: {label,select, workStagesLabel{Work Stages}stageLabel{Stage}selectLabel{Select}other{Not Defined}}
pt_br: {label,select, workStagesLabel{Estágios do Trabalho}stageLabel{Estágio}selectLabel{Selecionar}other{Não Definido}}

# StageMsg_stateNotInfomedMsg
source: State not informed.
pt_br: Estado não informado.

# StateMsg_label
source: {label,select, notStarted{Not Started}inProgress{In Progress}completed{Completed}other{Not Defined}}
pt_br: {label,select, notStarted{Não Iniciado}inProgress{Em Progresso}completed{Concluído}other{Não Definido}}

# WorkItemMsg_label
source: {label,select, workKanbanLabel{Work Kanban}workItemsLabel{Work Items}editWorkItemLabel{Edit Work Item}addWorkItemLabel{Add Work Item}selectAValueLabel{Select a value}workItemsOverDueLabel{Work Items Over Due}checkItemLabel{Check Item}noMatchLabel{No Match}dropFileHereLabel{Drop File Here}other{Not Defined}}
pt_br: {label,select, workKanbanLabel{Trabalho Kanban}workItemsLabel{Itens de Trabalho}editWorkItemLabel{Editar Itens de Trabalho}addWorkItemLabel{Adicionar Item de Trabalho}selectAValueLabel{Selecionar um Valor}workItemsOverDueLabel{Itens de Trabalho Atrasados}checkItemLabel{Item de Checagem}noMatchLabel{Sem Correspondência}dropFileHereLabel{Soltar Arquivo Aqui}other{Não Definido}}

# WorkItemMsg_valuePercentIntervalMsg
source: The percentual value should be between 0 and 100
pt_br: O valor percentual deverá estar entre 0 e 100

# ObjectiveMsg_label
source: {label,select, objectiveLabel{Objective}objectivesLabel{Objectives}addObjectiveLabel{Add Objective}editObjectiveLabel{Edit Objective}progressLabel{Progress}noMatchLabel{No Match}sortedByLabel{Sorted By}ultimateObjectiveLabel{Ultimate Objective}other{Not Defined}}
pt_br: {label,select, objectiveLabel{Objetivo}objectivesLabel{Objetivos}addObjectiveLabel{Adicionar Objetivo}editObjectiveLabel{Editar Objetivo}progressLabel{Progresso}noMatchLabel{Sem Correspondência}sortedByLabel{Ordenado Por}ultimateObjectiveLabel{Objetivo Final}other{Não Definido}}

# MapMsg_label
source: {label,select, objectivesMapLabel{Objectives Map}other{Not Defined}}
pt_br: {label,select, objectivesMapLabel{Mapa de Objetivos}other{Não Definido}}

# MapMsg_notInformedMsg
source: Not Informed!
pt_br: Não Informado!

# GanttMsg_label
source: {label,select, objectivesGanttLabel{Objectives Gantt}other{Not Defined}}
pt_br: {label,select, objectivesGanttLabel{Gantt de Objetivos}other{Não Definido}}

# MeasureMsg_label
source: {label,select, measuresLabel{Measures}editMeasureLabel{Edit Measure}addMeasureLabel{Add Measure}progressLabel{Progress}startValueLabel{Start Value}currentValueLabel{Current Value}endValueLabel{End Value}other{Not Defined}}
pt_br: {label,select, measuresLabel{Medidas}editMeasureLabel{Editar Medida}addMeasureLabel{Adicionar Medida}progressLabel{Progresso}startValueLabel{Valor Inicial}currentValueLabel{Valor Corrente}endValueLabel{Valor Final}other{Não Definido}}

# MeasureMsg_measureUnitLabel
source: {label,select, percentLabel{Percent}moneyLabel{Money}indexLabel{Index}unitaryLabel{Unitary}other{Not Defined}}
pt_br: {label,select, percentLabel{Percentual}moneyLabel{Monetário}indexLabel{Índice}unitaryLabel{Unitário}}

# MeasureMsg_valueErrorMsg
source: Incorret value. Possible reasons: a) Current value should be between Start and End Value. b) Start and End Value are equals.
pt_br: Valor Incorreto. Razões Possíveis: a) Valor corrente deveria estar entre valor inicial e final. b) Valor inicial e final são iguais.

# MeasureMsg_currentDateNotBetweenStartEndDate
source: Measure progress date should be between objective start date {startDateFormated} and objective end date {endDateFormated}.
pt_br: Data do progresso da medida deveria estar entre a data inicial do objetivo {startDateFormated} e data final do objetivo {endDateFormated}.

# MeasureMsg_decimalNumberErrorMsg
source: Decimal number should be between 0 and 5.
pt_br: Número decimal deveria estar entre 0 e 5.

# MeasureProgressMsg_label
source: {label,select, measureProgressLabel{Measure Progress}progressCurrentValuesLabel{Progress Current Values}other{Not Defined}}
pt_br: {label,select, measureProgressLabel{Progresso da Medida}progressCurrentValuesLabel{Valores do Progresso Corrente}other{Não Definido}}

# MeasureProgressMsg_valueErrorMsg
source: Current value should be between Start and End value.
pt_br: Valor corrente deveria estar entre o valor inicial e final.

# MeasureProgressMsg_currentValueExistsAtDate
source: Current value already exists at date informed.
pt_br: Valor corrente já existe na data informada.

# GroupMsg_label
source: {label,select, groupsLabel{Groups}editGroupLabel{Edit Group}addGroupLabel{Add Group}noMatchLabel{No Match}activeLabel{Active}inactiveLabel{Inactive}other{Not Defined}}
pt_br: {label,select, groupsLabel{Grupos}editGroupLabel{Editar Grupo}addGroupLabel{Adicionar Grupo}noMatchLabel{Sem Correspondência}activeLabel{Ativo}inactiveLabel{Inativo}other{Não Definido}}

# GroupMsg_groupTypeLabel
source: {label,select, company{Company}businessUnit{Business Unit}department{Department}team{Team}other{Not Defined}}
pt_br: {label,select, company{Organização}businessUnit{Unidade de Negócio}department{Departamento}team{Time}other{Não Definido}}

# InsightMsg_label
source: {label,select, insightsLabel{Insights}groupLabel{Group}leaderLabel{Leader}objectivesOverallLabel{Objectives Overall}objectivesMeasuresLabel{Objectives and Measures}worksWorkItemsLabel{Works and Work Items}objectivesLabel{Objectives}objectivesDescriptionLabel{Number total of objectives}objectivesAchievedLabel{Objectives Achieved}measuresAchievedDescriptionLabel{Measures over 70% progress}objectivesRequiringAttentionLabel{Objectives Requiring Attention}measuresRequiringAttentionDescriptionLabel{Measures below 30% progress}measuresLabel{Measures}measuresDescriptionLabel{Number total of measures}measuresAchievedLabel{Measures Achieved}measuresRequiringAttentionLabel{Measures Requiring Attention}worksLabel{Works}worksDescriptionLabel{Number total of works}worksCompletedLabel{Works Completed}worksCompletedDescriptionLabel{Works with 100% work items completed}worksRequiringAttentionLabel{Works Requiring Attention}worksRequiringAttentionDescriptionLabel{Works with over due work items}workItemsLabel{Work Items}workItemsDescriptionLabel{Number total of work items}workItemsCompletedLabel{Work Items Completed}workItemsCompletedDescriptionLabel{Work items with 100% progress}workItemsRequiringAttentionLabel{Work Items Requiring Attention}workItemsRequiringAttentionDescriptionLabel{Over due work items}other{Not Defined}}
pt_br: {label,select, insightsLabel{Insights}groupLabel{Grupo}leaderLabel{Lider}objectivesOverallLabel{Objetivos no Geral}objectivesMeasuresLabel{Objetivos e Medidas}worksWorkItemsLabel{Trabalhos e Itens de Trabalho}objectivesLabel{Objetivos}objectivesDescriptionLabel{Número total de objetivos}objectivesAchievedLabel{Objetivos Alcançados}measuresAchievedDescriptionLabel{Medidas acima de 70% de progresso}objectivesRequiringAttentionLabel{Objetivos Requerendo Atenção}measuresRequiringAttentionDescriptionLabel{Medidas abaixo de 30% de progresso}measuresLabel{Medidas}measuresDescriptionLabel{Número total de medidas}measuresAchievedLabel{Medidas Alcançadas}measuresRequiringAttentionLabel{Medidas Requerendo Atenção}worksLabel{Trabalhos}worksDescriptionLabel{Número total de trabalhos}worksCompletedLabel{Trabalhos Concluídos}worksCompletedDescriptionLabel{Trabalhos com 100% dos itens de trabalho concluídos}worksRequiringAttentionLabel{Trabalhos Requerendo Atenção}worksRequiringAttentionDescriptionLabel{Trabalhos com itens de trabalho atrasados}workItemsLabel{Itens de Trabalho}workItemsDescriptionLabel{Número total de items de trabalho}workItemsCompletedLabel{Items de Trabalho Concluídos}workItemsCompletedDescriptionLabel{Itens de Trabalho com 100% de progresso}workItemsRequiringAttentionLabel{Itens de Trabalho Requerendo Atenção}workItemsRequiringAttentionDescriptionLabel{Itens de trabalho atrasados}other{Não Definido}}

# SystemFunctionMsg_inPastLabel
source: {functionName,select, create{Created}update{Updated}delete{Deleted}read{Read}other{Not Defined}}
pt_br: {functionName,select, create{Criado(a)}update{Atualizado(a)}delete{Deletado(a)}read{Lido(a)}other{Não Definido}}

# TimelineItemdMsg_label
source: {fieldName,select, timelineLabel{Timeline}dayAgoLabel{day ago}daysAgoLabel{days ago}hourAgoLabel{hour ago}hoursAgoLabel{hours ago}minuteAgoLabel{minute ago}minutesAgoLabel{minutes ago}secondAgoLabel{second ago}secondsAgoLabel{seconds ago}valueLabel{value}changedFromLabel{changed from}wasLabel{was}other{Not Defined}}
pt_br: {fieldName,select, timelineLabel{Linha do tempo}dayAgoLabel{dia atrás}daysAgoLabel{dias atrás}hourAgoLabel{hora atrás}hoursAgoLabel{horas atrás}minuteAgoLabel{minuto atrás}minutesAgoLabel{minutos atrás}secondAgoLabel{segundo atrás}secondsAgoLabel{segundos atrás}valueLabel{valor}theLabel{o}changedFromLabel{alterado de}wasLabel{era}other{Não Definido}}

# MailMsg_label
source: {label,select, thisLabel{this}other{Not Defined}}
pt_br: {label,select, thisLabel{deste(a)}other{Not Defined}}

# MailMsg_youIsReceivingThisEMailBecauseYouAreThe
source: You are receiving this e-mail because you are the
pt_br: Você está recebendo este e-mail porque você é o(a)

# MailMsg_viewOrReplyIt
source: View or reply it on Auge
pt_br: Veja ou responda ele no Auge

# MailMsg_toDefineNewPasswordInformTheCode
source: To define new password inform the code
pt_br: Para definir a nova senha informe o código

# MailMsg_youIsReceivingThisEMailBecauseNewPasswordWasRequired
source: You are receiving this e-mail because new password was required. Ignore this e-mail if you didn't request new password.
pt_br: Você está recebendo este e-mail porque uma nova senha foi solicitada. Ignore este e-mail se você não solicitou uma nova senha.

# MailMsg_subjectNewPasswordRequired
source: New Password Required
pt_br: Nova Senha Solicitada.

# MailMsg_InformIt
source: Inform it on Auge
pt_br: Informe ela no Auge
